{
    "A":[
      {
        "word": "Angle",
        "def": "A method of verbal attack"
      },
      {
        "word": "Antic",
        "def": "A joke or prank done during a battle that has absolutely nothing to do with rhyming or the battle itself, just to gain attention or cause controversy. Rapper Daylyt is known for starting this, and is probably the only one who does them or has done them (i.e. taking a crap on stage, rubbing ball sweat on the opponent's face)"
      }

    ],
    "B":[
      {"word": "Bang",
      "def": "A method of verbal attack"
      },
      {
        "word" : "Bar",
        "def": " In broader music theory, a segment of time defined by a given number of beats in a musical composition. In the context of rap, which may or may not be accompanied by music, loosely analogous to a poetic stanza or strophe (i.e. a grouped set of lines of determinable measure). Bars often are spoken of symbolically as a sort of wealth or stock possessed of oneself or another rapper."
      },
       {
       "word": "Bitchmade",
       "def": "Offensive. Displaying weakness, fear, emotionality and/or lack of character, as thought to be undesirable feminine traits. (See pussy.)"
      },
      {
        "word":"Biting",
        "def": "To copy or steal an aspect of rapping from another rapper."
      },
      {
        "word": "Body bag (short form: body)",
        "def": "Figuratively kill an opponent (i.e. place them in a body bag); dominate an opponent in competition. One of the most famous and universally accepted body bags is Loaded Lux vs Calicoe. (See murder.)"
      }
    ],
    "C":[
      {
        "word": "Check: 1",
        "def": "Borrowed from sports jargon, aggress an opponent through physical touch."
       },
        {"word": "Check: 1",
        "def": "Stop or slow down the progress of an opponent's progress, attack, or claim."
      },
      { 
        "word": "Cheese",
        "def": "Money"
      },

    {
      "word": "Choke",
      "def": "Run out of rapped lines prematurely either by forgetting prepared bars or failing to freestyle fluidly; arguably the single most incriminating misstep in rap delivery. Not to be confused with stumbling."
  },

    { 
      "word": "Chrome", 
      "def": "A handgun, esp. one with nickel plating."
    },
    {
      "word": "Cipher 1( also cypher)", 
      "def": "An informal gathering of rappers (but possibly other types of performance artists as well), esp. in a circle, in order to showcase their respective talents collegially or competitively."
    },
      {
      "word": "Cipher 2( also cypher)",
      "def": "2. Noun. The performance circle including surrounding spectators, whose response adds to the communal character of the event."
      },

    {
      "word": "Classic",
      "def": "A battle or performance remembered (or expected to be remembered) over time as exhibiting outstanding artistry or dynamism.}"
    },
    {
      "word": "Cook",
      "def": "The art of building up 3 to 4 bars for an impressive punch-line that summarizes the pervious bars."
      }
    ],
    "D":[ 
      {
        "word": "Dickrider",
        "def": "Offensive. An ardent fan or devotee."
      },
        {
          "word":"Disrespect" ,
          "def": "Attack employing the egregious invasion of sensitive areas in an opponent's offstage life. Deaths, illnesses, sexual indignities, and legal troubles endured by an opponent or his/her loved ones are popular inspirations for disrespectful attacks. (A signature tactic of Arsonal.)"
        },
      {
      "word": "Don DeMarco",
      "def": "The sampled namedrop of the DJ for URL events. Earlier in URL's history, when a battler's line got lots of crowd reaction, the DJ played an airhorn sound effect followed by the drop of his own name. This became so frequent that audiences from both URL and other battle leagues began to shout the response themselves. The namedrop is sampled from rapper Jay-Z's song Can't Knock the Hustle."
    },
  {
    "word":"Dope",
    "def": "Skillful, inspired. (See also nice; constrast with wack.)"
  }
],

"E":[
   {
  "word": "Earl", 
  "def": "Personification of a choke; a demon that possesses battle rappers and makes them choke."
  },
  {
  "word": "Expose",
  "def": "Publicly exploit -- on or offstage -- a vulnerability in one's opponent(s)."
},
  {
  "word": "Emotional",
  "def": "When the opponent talks during your rap or complains about a line used against them."
  }
],
  "F":[ 
    {
    "word": "Flow: 1.",
    "def": "The recognizable cadence with which a rapper delivers his/her lines. 2. Verb. Deliver lines in a recognizable cadence, esp. in an appealing manner."
},
  {
    "word": "Freestyle: 1.",
    "def": "(1). An ad lib rap, delivered entirely through improvisation (off the dome) or constructed from stock bars committed to memory."
  },
    {
      "word": "Freestyle: 2",
      "def": " A rhyme Free of style i.e. can be written or improvised that is not necessarily fitted for the song or beat that it is performed upon. It can be a whole mish-mash of stuff. 3. Verb. Deliver an ad lib rap."
}
  ],
"G":[ 
  {
  "word":"Gangbang (short form: bang)",
  "def": "Engage in street gang and/or organized crime activity."
},
{
  "word":"Gas", 
  "def": "Venerate or encourage (someone) with praise, esp. beyond the degree warranted."
},
{
  "word":"Ghostwrite:",
  "def":"Write the lines of another who is the presumed or credited author. While the practice assumes a desirable artistry on the part of the ghostwriter, performing ghostwritten lines generally is frowned upon in the battle rap community."
},
{
  "word": "Gimmick",
  "def": "A trick or device intended to attract attention, publicity, or business. Nudity, eccentric behavior, and outrageous costumes are signature gimmicks of Daylyt."
},
{
  "word":"Goat",
  "def": "Acronym for Greatest of all time. An individual's personal favorite battle rapper."
},
 {
  "word":"Government", 
  "def":"A rapper's legal name (and other personal information) that can be used derisively against the rapper. This method shatters the persona and stage name presented. (See expose and personal)" 
},
 {
  "word":"Gun bar (also gun line)",
  "def":"A bar about guns and related firepower and/or accessories."
}
],
"H":[ 
  {
  "word":"Hypeman", 
  "def": "A rapper's sidekick or entourage member in attendance at a performance, esp. onstage, to function as a cheerleader, agitator, or prop. A hypeman's duties might include providing exaggerated reactions to their rapper's bars, offering high fives, or shouting phrases designed to rile an audience."
},
 
  {
  "word":"Herb",
  "def": "Loser, poser, uncool person."
 },
{
  "word": "Hay-maker", 
  "def": "A powerful punchline"
}
],
"I":[ 
  {
  "word":"I Got A Gun So Big...",
  "def": "A cliche bar that started sometime around 2014. It became a popular trend for battle rappers to write a variation of this bar for both comedic & lyrical value. It is unclear who started it."
},
 {
  "word": "Ill" ,
  "def": "Skillful, talented, or inspired beyond common sensibilities said of both rappers and their work.(See sick; contrast with wack.)"
}
],
"J":[
  {
  "word": "Jamie",
  "def": "Similar to a Stan, obsessed fan, groupie, or stalker, but of battle  rappers. (See Oh no it's Jamie)"
}
],
"L":[
  {
  "word": "Lame",
  "def": "Not up to par, less than desirable. Or not working properly. Uncool or Corny. Usually used to describe a rapper or his body of work, in a negative way."
}
],
"M":[
  {
  "word": "Murder" ,
  "def": "Figuratively kill an opponent; dominate an :opponent in competition. (See body bag.)"
},
{
  "word": "Multisyllable rhyme (Short form: multi)",
  "def": "Grouped phrases in which more than one syllable rhymes."
}
],
 
"N":[
  {
  "word": "Name flip", 
  "def":"Tactic wherein a battler lampoons his/her opponent's name with witty wordplay. "
},
{
  "word": "Nice", 
  "def": "Skillful, inspired. (See also dope; contrast with wack.)"
}
],
"P":[
{
  "word": "Performance: 1.", 
  "def":"An act of staging or delivering a rap." 
},
{
  "word":"Performance 2:", 
  "def": "2. Noun. The theatricality of a rap delivery, as separate from its rhetorical content or technical merit."
},
{
  "word": "Personal", 
  "def": "A verbal attack highlighting details (often embarrassing) of an opponent's offstage life."
},
 {
  "word": "PG", 
  "def": "Abbreviation for Proving Grounds, which is the entrance level sub-league of URL. They are constantly being attacked by the vets because almost none of them make it to the big stage despite there being multiple classes of PG rappers recruited post 2010"
},

 {
  "word": "Promotional (also promo) battle",
  "def": "A rap battle wherein opponents agree ahead of time to forgo formal judging. Battlers might pursue such an arrangement if they fear a loss would sully their record or if an opponent is sufficiently junior to them as to constitute a step down in their formal battling trajectory."
},
 {
  "word": "Prop: 1.",
  "def": "A physical accessory, including another person, used to assist execution of one's rap. Incriminating photos of an opponent, for example, would be a popular prop."
},
 { 
  "word": "Prop: 2.",
  "def": "An accolade or point of praise cited in honor of another."
},
  {
    "word":"Punchline",
    "def":"A line delivered as the climax to a joke or series of setup bars."
},
 {
  "word":"Pussy",
  "def": "Offensive. One who displays weakness, fear, emotionality and/or lack of character, as thought to be undesirable feminine traits. (See bitchmade.)"
}
],
"R":[
  {
  "word": "Raids",
  "def": "Silly rhyme absurd meaningless; in French"
},
 {
  "word": "Reach: 1.",
  "def": "An excessively forced metaphor, scheme, or wordplay."
},
{
  "word": "Reach: 2.",
  "def": "2. Verb. Deliver an excessively forced metaphor, scheme, or wordplay."
},
{
  "word": "Reality",
  "def": "Nonfictionalized offstage life as inspiration for a rap."
},
 {
  "word":"Rebuttal", 
  "def": "Bars delivered to counter an opponent's comment earlier in the same battle. Given the inability to foresee such comments, rebuttals are often delivered freestyle."
},
 {
  "word":"Remix",
  "def": "The repeat of a line in a slightly varied, embellished fashion so as to bolster its impact. (A signature tactic of Hitman Holla.)"
},
 {
  "word": "Ring",
  "def": "The firing of a gun, esp. an automatic one."
}
],
"S":[
  {
  "word": "Scheme", 
   "def" : "An extended measure of bars executed under a particular aesthetic theme or narrative arc. Attacks wherein rappers assume the identity or universe of pop culture or literary figures are popular schemes."
},
{
  "word":"Setup",
  "def":"A series of bars executed as a lead-in to a verbal payoff, or punchline."
},
{
  "word":"Sick",
  "def":"Skillful, talented or inspired beyond common sensibilities; said of both rappers and their work. (See ill; contrast with wack.)"
},
 {
  "word": "Sing", 
  "def": "The sound of a gun being fired, esp. an automatic rifle."
},
 {
  "word":"Slow it down",
  "def":"A cue to rivals and/or the audience to pause and reconsider a bar just delivered. Such reconsideration often unveils hidden wordplay or multiple meanings. (A signature tactic of Conceited.)"
},
 {
  "word":"Spit" ,
  "def":"Deliver a rap."
},
 {
  "word": "Stumble",
  "def": "Momentarily lose one's verbal composure."
 }
],
 "T":[
   {
  "word": "Three-O", 
  "def": "Refers to 3-0 meaning one of the rappers won 3 rounds while the other won 0 rounds. Does not always equate to a body. One of the most notable 3-0s is Tay Roc vs DNA where the crowd was actually throwing up hand gestures to indicate a 3-0."
},
  {
  "word":"Top-Tier" ,
  "def":"The roster of URL rappers that came up around 2009-2011. Despite recruiting a handful of potential new-comers yearly, the list of rappers considered Top-Tier remains relatively unchanged since 2011. Rappers in this category usually originates from the Midwest Movement, Fight Klub, original SMACK DVD's, Lionz Den, or the PG class of 2010-2011."
},
 {
  "word": "Tight",
  "def":"Angry or agitated."
}
],
"W":[
  {
  "word":"Wack" ,
  "def": "Unskillful, uninspired; said of a rapper or his/her work."
},
  {
    "word": "Wordplay",
    "def": "You have to be born with it basically."
  }
]
}
